# Pandas基础

Pandas是构建在Numpy的基础上的，所以一般我们在需要把pandas import进来的时候，最好把numpy也一起import；

Pandas主要有三大类型：

Series

Dataframe

Panel

In [2]:
import numpy as np
import pandas as pd
import warnings; warnings.simplefilter('ignore') #忽略可能会出现的警告信息，警告并不是错误，可以忽略；

### 1. Series构建和基础用法

In [2]:
# 通过list构建Series，list转换成为Series，用pd.Series;
df = pd.Series(range(10, 20))
type(df)

pandas.core.series.Series

In [3]:
df

0    10
1    11
2    12
3    13
4    14
5    15
6    16
7    17
8    18
9    19
dtype: int32

In [4]:
df.values               #可以获得具体的value；

array([10, 11, 12, 13, 14, 15, 16, 17, 18, 19])

In [5]:
type(df.values)               #series其实是由Ndarry构成的；

numpy.ndarray

In [9]:
df.head(10)                   #DataFrame中的.head()方法；

0    10
1    11
2    12
3    13
4    14
5    15
6    16
7    17
8    18
9    19
dtype: int32

In [10]:
df[0]

10

In [11]:
df[8]                  #通过索引获得数据的value；

18

In [12]:
df[df > 15]            #Series中选择满足条件的数据；重点掌握；

6    16
7    17
8    18
9    19
dtype: int32

In [13]:
df > 15

0    False
1    False
2    False
3    False
4    False
5    False
6     True
7     True
8     True
9     True
dtype: bool

In [15]:
#通过字典构建Series
sales_data = {'a': 1, 'b': 2, 'c': 3}
df = pd.Series(sales_data)
df

a    1
b    2
c    3
dtype: int64

In [16]:
df.index              #Series的index属性；

Index(['a', 'b', 'c'], dtype='object')

In [19]:
df.name = 'Series1'
df.index.name = 'Index'
df.head()

Index
a    1
b    2
c    3
Name: Series1, dtype: int64

In [21]:
df = pd.Series(range(8,14), index = ['a', 'b', 'c', 'd', 'e','f'])
df

a     8
b     9
c    10
d    11
e    12
f    13
dtype: int32

In [24]:
df[3]                #index行索引,通过position，通过位置进行的索引；

11

In [27]:
df['d']             #index标签索引

11

In [25]:
df[1:3]             #切片索引，用index索引前闭后开，position索引；

b     9
c    10
dtype: int32

In [28]:
df['b':'d']        #切片索引，用label索引都是闭区间，注意用position索引和label索引的区别

b     9
c    10
d    11
dtype: int32

In [31]:
df[['a', 'd']]       #不连续索引,通过list进行传递；

a     8
d    11
dtype: int32

### 2. DataFrame的构建

#### 2.1 通过Numpy构建DataFrame

In [47]:
array = np.random.randn(6,4)
array

array([[ 0.12076351,  0.00894188,  1.61175192,  0.17941872],
       [-0.33586583,  1.35128107, -0.96854778, -0.55056321],
       [ 0.28232073, -0.06541281, -0.82860594,  0.59417669],
       [-1.73360361, -0.29234947, -1.53458805,  0.0192691 ],
       [-0.44802276,  0.08133935,  2.29853902,  0.59580676],
       [ 0.96625831,  0.60578328,  0.97159637,  1.15419816]])

In [48]:
df = pd.DataFrame(array)               #通过Ndarray构建Dataframe,如果没有声明，默认的行index和列index都是从0开始；
df.head()

          0         1         2         3
0  0.120764  0.008942  1.611752  0.179419
1 -0.335866  1.351281 -0.968548 -0.550563
2  0.282321 -0.065413 -0.828606  0.594177
3 -1.733604 -0.292349 -1.534588  0.019269
4 -0.448023  0.081339  2.298539  0.595807

In [50]:
df = pd.DataFrame(np.random.randn(6,4), columns = ['a', 'b', 'c', 'd'], index = ['e','f','g','h','i','j'] )    #构建的时候明确了行和列的标签；
df

          a         b         c         d
e  0.460790  0.434568  0.747517 -0.290976
f  1.619017 -0.032428 -0.914960  0.141304
g  2.466882 -1.983068  0.315625 -0.503023
h  0.677443 -1.681895  0.731671  0.856143
i -0.702731 -0.819589 -1.886940  0.240970
j -1.331922 -0.945398  0.102177 -0.816075

#### 2.2 通过字典构建DataFrame

In [3]:
# 通过字典构建DataFrame
dict_data = {'Date': pd.datetime(2017,6,30),
             'Number': pd.Series([6,6,6]),
             'Course_name' : pd.Series(["Python","Quant","Finance","CFA"]),     #直接传一个list进去也是完全可以的；
             'Company' : 'SJTU' }
# 显示DataFrame
df = pd.DataFrame(dict_data)
df.head()

  Company Course_name       Date  Number
0    SJTU      Python 2017-06-30     6.0
1    SJTU       Quant 2017-06-30     6.0
2    SJTU     Finance 2017-06-30     6.0
3    SJTU         CFA 2017-06-30     NaN

#### 2.3 自定义构建DataFrame

In [59]:
df = pd.DataFrame([10, 30, 60, 80], columns=['Quantity'],
                  index=['a', 'b', 'c', 'd'])
df

   Quantity
a        10
b        30
c        60
d        80

In [60]:
type(df)

pandas.core.frame.DataFrame

In [61]:
type(df.values)

numpy.ndarray

In [62]:
type(df.Quantity)

pandas.core.series.Series

In [57]:
df = pd.Series([10, 30, 60, 80], 
                  index=['a', 'b', 'c', 'd'])
df

a    10
b    30
c    60
d    80
dtype: int64

In [58]:
type(df.values)

numpy.ndarray

### 3. DaraFrame的选择操作

In [4]:
# 通过字典构建DataFrame
dict_data = {'Date': pd.datetime(2017,6,30),
             'Number': pd.Series([6, 6, 6, 6]),
             'Course_name' : pd.Series(["Python","Quant","Finance","CFA"]),     #直接传一个list进去也是完全可以的；
             'Company' : 'SJTU' }

df = pd.DataFrame(dict_data)
df.head()

  Company Course_name       Date  Number
0    SJTU      Python 2017-06-30       6
1    SJTU       Quant 2017-06-30       6
2    SJTU     Finance 2017-06-30       6
3    SJTU         CFA 2017-06-30       6

#### 3.1 通过标签获取数据

In [5]:
df['Course_name']               #通过Columns索引获取数据

0     Python
1      Quant
2    Finance
3        CFA
Name: Course_name, dtype: object

In [6]:
df['Date']

0   2017-06-30
1   2017-06-30
2   2017-06-30
3   2017-06-30
Name: Date, dtype: datetime64[ns]

In [7]:
df[['Date','Course_name']]

        Date Course_name
0 2017-06-30      Python
1 2017-06-30       Quant
2 2017-06-30     Finance
3 2017-06-30         CFA

In [71]:
df[0]                       #Dataframe无法通过Index获得数据；故意报错；

In [8]:
df.ix[0]                        #需要使用具体的行索引选择工具，后面会完整讲到其具体的用法

Company                       SJTU
Course_name                 Python
Date           2017-06-30 00:00:00
Number                           6
Name: 0, dtype: object

In [9]:
df = pd.DataFrame(np.random.randn(5,5), columns = ['a', 'b', 'c', 'd','e'], index = ['f','g','h','i','j'] )    #构建的时候明确了行和列的标签；
df.head()

          a         b         c         d         e
f -0.039698 -0.968219  0.333482  0.012276 -1.294529
g -1.132276  0.449327 -1.739492  0.037762  0.907009
h -0.330395  1.198651  0.507229  0.736322  0.403758
i -0.480960  0.397164  0.940963 -0.221765  0.086219
j  0.286745  1.216561  0.148662  0.260043  0.203009

In [10]:
# 列标签索引
df['a']               # 返回Series类型；

f   -0.039698
g   -1.132276
h   -0.330395
i   -0.480960
j    0.286745
Name: a, dtype: float64

In [11]:
df[['a','c']]        #不连续索引

          a         c
f -0.039698  0.333482
g -1.132276 -1.739492
h -0.330395  0.507229
i -0.480960  0.940963
j  0.286745  0.148662

In [77]:
df['f']        # 不可通过行index直接进行索引，会故意报错；

In [12]:
df.ix['f']

a   -0.039698
b   -0.968219
c    0.333482
d    0.012276
e   -1.294529
Name: f, dtype: float64

#### 3.2 标签索引 loc方法

In [79]:
# 按行选择
df.loc['f']                    #基于label(如果只有一个索引则为行的index，行优先)的索引。

a    1.606649
b    0.510823
c    1.194044
d    0.853860
e   -0.573844
Name: f, dtype: float64

In [80]:
df.loc[['f','h','i']]

          a         b         c         d         e
f  1.606649  0.510823  1.194044  0.853860 -0.573844
h  0.743184  0.857154 -0.724574 -0.364256  0.461940
i -1.254231 -0.484429 -0.697796  0.294725 -0.235320

In [81]:
df.loc['f':'i']

          a         b         c         d         e
f  1.606649  0.510823  1.194044  0.853860 -0.573844
g -0.234542 -0.771723  0.460263  2.175153  0.241556
h  0.743184  0.857154 -0.724574 -0.364256  0.461940
i -1.254231 -0.484429 -0.697796  0.294725 -0.235320

In [82]:
df.loc[['f','h'] ,['a']]       #通过标签进行索引；

          a
f  1.606649
h  0.743184

In [83]:
df.loc[['f','h'] ,['a','b']]

          a         b
f  1.606649  0.510823
h  0.743184  0.857154

#### 3.3 位置索引 iloc

In [85]:
df

          a         b         c         d         e
f  1.606649  0.510823  1.194044  0.853860 -0.573844
g -0.234542 -0.771723  0.460263  2.175153  0.241556
h  0.743184  0.857154 -0.724574 -0.364256  0.461940
i -1.254231 -0.484429 -0.697796  0.294725 -0.235320
j -0.525963 -0.907670 -1.533226 -0.483149  1.323317

In [84]:
# 整型位置索引 iloc
df.iloc[1:3]                  #前闭后开；

          a         b         c         d         e
g -0.234542 -0.771723  0.460263  2.175153  0.241556
h  0.743184  0.857154 -0.724574 -0.364256  0.461940

In [86]:
df.loc['g':'h']             #双闭区间；label；

          a         b         c         d         e
g -0.234542 -0.771723  0.460263  2.175153  0.241556
h  0.743184  0.857154 -0.724574 -0.364256  0.461940

In [87]:
df.iloc[0:2, 0]

f    1.606649
g   -0.234542
Name: a, dtype: float64

#### 3.4 混合索引 ix： 既可以按位置，也可以按照标签(注意Pandas新版中即将取消该功能)

In [88]:
# 混合索引 ix
df.ix[1:3]

          a         b         c         d         e
g -0.234542 -0.771723  0.460263  2.175153  0.241556
h  0.743184  0.857154 -0.724574 -0.364256  0.461940

In [89]:
df.ix[0:2, 1]            # 先按标签索引尝试操作，然后再按位置索引尝试操作

f    0.510823
g   -0.771723
Name: b, dtype: float64

In [90]:
df.ix[0:3, 'b']          #既可以按位置，也可以按标签

f    0.510823
g   -0.771723
h    0.857154
Name: b, dtype: float64

In [91]:
df.ix[0:3, 'a': 'c']

          a         b         c
f  1.606649  0.510823  1.194044
g -0.234542 -0.771723  0.460263
h  0.743184  0.857154 -0.724574

In [92]:
df.ix['f':'i', 'b': 'd']

          b         c         d
f  0.510823  1.194044  0.853860
g -0.771723  0.460263  2.175153
h  0.857154 -0.724574 -0.364256
i -0.484429 -0.697796  0.294725

###  4. DataFrame 修改操作

In [97]:
df = pd.DataFrame([80.5, 90, 58, 88], columns=['Scores'],
                  index=['a', 'b', 'c', 'd'], dtype = 'f')
df

   Scores
a    80.5
b    90.0
c    58.0
d    88.0

In [98]:
df.dtypes

Scores    float32
dtype: object

#### 4.1 DataFrame重要属性和方法

In [99]:
df.index           #获得index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [100]:
df.columns         # 获得列名；

Index(['Scores'], dtype='object')

In [101]:
df.Scores

a    80.5
b    90.0
c    58.0
d    88.0
Name: Scores, dtype: float32

In [102]:
type(df.Scores)

pandas.core.series.Series

In [103]:
df.ix['c']         # 需要牢记ix的用法；

Scores    58.0
Name: c, dtype: float32

In [104]:
df.loc['c']

Scores    58.0
Name: c, dtype: float32

In [106]:
df['Scores']

a    80.5
b    90.0
c    58.0
d    88.0
Name: Scores, dtype: float32

In [107]:
df.ix[['a', 'd']]         # 混合选择，注意有两个方括号；

   Scores
a    80.5
d    88.0

In [108]:
df.index[1:3]              #这个是选择index

Index(['b', 'c'], dtype='object')

In [ ]:
df.ix[df.index[1:3]]       # ix才是选择对应的value；

In [109]:
df.ix[1:3]

   Scores
b    90.0
c    58.0

In [110]:
df.iloc[1:3]

   Scores
b    90.0
c    58.0

In [ ]:
df.     #tab

In [111]:
df.sum()                # 默认按列求和；

Scores    316.5
dtype: float32

In [112]:
df            #前面修改都是df的视图，原来的df并没有发生改变；

   Scores
a    80.5
b    90.0
c    58.0
d    88.0

In [113]:
df.rename(columns={'Scores':'Score'})               #重命名列,注意重命名的时候要用字典来进行传输；

   Score
a   80.5
b   90.0
c   58.0
d   88.0

In [115]:
df.rename(columns={'Scores':'Score'}, inplace = True)    #替换原来的df

In [117]:
df = df.rename(columns={'Score':'Scores'})    #重新赋值也是可以修改原视图并进行替换；

In [118]:
df

   Scores
a    80.5
b    90.0
c    58.0
d    88.0

In [119]:
df.shape

(4, 1)

**4.2 DataFrame的向量化操作**

In [120]:
df

   Scores
a    80.5
b    90.0
c    58.0
d    88.0

In [121]:
df + df

   Scores
a   161.0
b   180.0
c   116.0
d   176.0

In [123]:
df * 3

   Scores
a   241.5
b   270.0
c   174.0
d   264.0

In [124]:
df ** 2                          #类似Numpy的操作；可以不用循环，实现元素级的运算；

    Scores
a  6480.25
b  8100.00
c  3364.00
d  7744.00

In [125]:
df['Scores'] = df['Scores'].astype('int')             #修改数据类型；astype()

In [126]:
df.dtypes

Scores    int32
dtype: object

#### 4.3 修改DataFrame

In [13]:
# 通过字典构建DataFrame
dict_data = {'Date': pd.datetime(2017,6,30),
             'Number': pd.Series([6, 6, 6, 6]),
             'Course_name' : pd.Series(["Python","Quant","Finance","CFA"]),     #直接传一个list进去也是完全可以的；
             'Company' : 'SJTU' }

df = pd.DataFrame(dict_data)
df.head()

  Company Course_name       Date  Number
0    SJTU      Python 2017-06-30       6
1    SJTU       Quant 2017-06-30       6
2    SJTU     Finance 2017-06-30       6
3    SJTU         CFA 2017-06-30       6

In [14]:
#增加具体的列,在策略中是非常重要的；
df['Period'] = range(21,25)
df.head()

  Company Course_name       Date  Number  Period
0    SJTU      Python 2017-06-30       6      21
1    SJTU       Quant 2017-06-30       6      22
2    SJTU     Finance 2017-06-30       6      23
3    SJTU         CFA 2017-06-30       6      24

In [15]:
# 删除列
del(df['Period'] )
df.head()

  Company Course_name       Date  Number
0    SJTU      Python 2017-06-30       6
1    SJTU       Quant 2017-06-30       6
2    SJTU     Finance 2017-06-30       6
3    SJTU         CFA 2017-06-30       6

In [16]:
df = pd.DataFrame([80.5, 90, 58, 88], columns=['Scores'],
                  index=['a', 'b', 'c', 'd'], dtype = 'f')
df

   Scores
a    80.5
b    90.0
c    58.0
d    88.0

In [17]:
df['Hours'] = (2.1, 1.5, 1.6, 2.2)                     # 新增column的用法需要重点掌握，在分析股票数据时非常有用；
df

   Scores  Hours
a    80.5    2.1
b    90.0    1.5
c    58.0    1.6
d    88.0    2.2

In [18]:
df['Hours']                       #选择具体的某一列

a    2.1
b    1.5
c    1.6
d    2.2
Name: Hours, dtype: float64

In [19]:
#将一个完整dataFrame作为新建的列，Pandas会自动根据index的label进行匹配
df['Names'] = pd.DataFrame(['Alpha', 'Beta', 'Gamma', 'Theta'],   
                           index=['d', 'b', 'a', 'c'])
df

   Scores  Hours  Names
a    80.5    2.1  Gamma
b    90.0    1.5   Beta
c    58.0    1.6  Theta
d    88.0    2.2  Alpha

**4.4 DataFrame对齐操作**

In [134]:
df1 = pd.DataFrame(np.random.random((6,6)), columns = ['a', 'b','c','d','e','f'])
df2 = pd.DataFrame(np.random.random((3,3)), columns = ['a', 'b', 'c'])

In [135]:
df1

          a         b         c         d         e         f
0  0.306465  0.650042  0.382987  0.664129  0.660192  0.430710
1  0.638582  0.179455  0.800233  0.049455  0.946618  0.859000
2  0.393196  0.294454  0.955929  0.649859  0.431248  0.189606
3  0.173000  0.989861  0.257547  0.875490  0.058619  0.886442
4  0.566411  0.768073  0.891766  0.871969  0.305398  0.503355
5  0.751396  0.383719  0.010182  0.570287  0.507725  0.698975

In [136]:
df2

          a         b         c
0  0.869475  0.289202  0.442661
1  0.880406  0.354192  0.703638
2  0.161238  0.735637  0.446094

In [141]:
df3 = df1 + df2     
df3                                  #DataFrame会自动对齐；

          a         b         c   d   e   f
0  1.175940  0.939244  0.825648 NaN NaN NaN
1  1.518988  0.533646  1.503871 NaN NaN NaN
2  0.554434  1.030090  1.402022 NaN NaN NaN
3       NaN       NaN       NaN NaN NaN NaN
4       NaN       NaN       NaN NaN NaN NaN
5       NaN       NaN       NaN NaN NaN NaN

In [142]:
df3.fillna(0, inplace = True)
df3

          a         b         c    d    e    f
0  1.175940  0.939244  0.825648  0.0  0.0  0.0
1  1.518988  0.533646  1.503871  0.0  0.0  0.0
2  0.554434  1.030090  1.402022  0.0  0.0  0.0
3  0.000000  0.000000  0.000000  0.0  0.0  0.0
4  0.000000  0.000000  0.000000  0.0  0.0  0.0
5  0.000000  0.000000  0.000000  0.0  0.0  0.0

#### 4.5 按条件筛选数据——应用于条件选股

In [143]:
d = {'PE' : pd.Series([10., 20., 30., 40.], index=['Company a', 'Company b', 'Company c','Company d']),
     'PB' : pd.Series([2., 3., 2.5, 4.], index=['Company a', 'Company b', 'Company c', 'Company d']),
     'ROE' : pd.Series([0.06, 0.1, 0.08, 0.02], index=['Company a', 'Company b', 'Company c', 'Company d'])}
df = pd.DataFrame(d)
df

            PB    PE   ROE
Company a  2.0  10.0  0.06
Company b  3.0  20.0  0.10
Company c  2.5  30.0  0.08
Company d  4.0  40.0  0.02

In [144]:
df.PE < 25

Company a     True
Company b     True
Company c    False
Company d    False
Name: PE, dtype: bool

In [145]:
df[df.PE < 25]

            PB    PE   ROE
Company a  2.0  10.0  0.06
Company b  3.0  20.0  0.10

In [148]:
df[df['PE'] < 25]                   #效果相同；

            PB    PE   ROE
Company a  2.0  10.0  0.06
Company b  3.0  20.0  0.10

In [149]:
(df.PE < 25) * 1

Company a    1
Company b    1
Company c    0
Company d    0
Name: PE, dtype: int32

In [161]:
df[(df.PE < 25)  | (df.PB < 2.5) ]                            #多个逻辑条件组合,每个条件需要括号；
                                                            #  & |,不能用and或者or

            PB    PE   ROE
Company a  2.0  10.0  0.06
Company b  3.0  20.0  0.10

In [162]:
df[ (df.PE < 25) * 1  + (df.PB < 2.5) * 1  == 2  ]                 #多个逻辑条件

            PB    PE   ROE
Company a  2.0  10.0  0.06

In [163]:
df[ (df.PE < 25) * 1  + (df.PB < 2.5) * 1  + (df.ROE> 0.07) * 1 >= 2  ]      #三个当中满足任意两个选股条件；重要

            PB    PE   ROE
Company a  2.0  10.0  0.06
Company b  3.0  20.0  0.10

**4.6 DataFrame Apply函数的重点应用**

In [2]:
a = np.random.randn(9, 6)
a.round(5)

array([[-1.20002, -0.14367, -1.58155, -1.30232,  1.62077,  0.5075 ],
       [ 0.02166, -0.09557,  0.38237, -0.83064, -0.86543, -1.03234],
       [-0.18572, -1.52146,  0.64019,  0.26622, -0.2073 , -1.3267 ],
       [ 1.40622,  1.10243,  0.79658,  0.44978, -1.67601,  1.1721 ],
       [ 1.0033 , -1.1854 , -1.89615,  1.21855,  2.06018, -0.11492],
       [-1.93645, -0.81568, -0.47105, -0.38618, -0.01978, -0.0619 ],
       [ 0.12263,  0.08552,  0.57588, -0.54658,  1.92488, -1.13511],
       [ 0.86115,  0.89275,  1.6486 , -0.81595,  0.36647,  1.00536],
       [-2.13036,  1.90252, -0.76175,  2.02238, -1.57567, -0.17484]])

In [3]:
df = pd.DataFrame(a)                          #通过ndarray来构建DataFrame,这种方法要熟练掌握；
df

          0         1         2         3         4         5
0 -1.200017 -0.143673 -1.581553 -1.302320  1.620774  0.507504
1  0.021663 -0.095572  0.382365 -0.830639 -0.865432 -1.032340
2 -0.185721 -1.521455  0.640193  0.266223 -0.207297 -1.326699
3  1.406219  1.102431  0.796584  0.449783 -1.676008  1.172102
4  1.003298 -1.185395 -1.896151  1.218548  2.060183 -0.114918
5 -1.936451 -0.815682 -0.471055 -0.386179 -0.019781 -0.061896
6  0.122627  0.085518  0.575877 -0.546578  1.924884 -1.135114
7  0.861148  0.892745  1.648597 -0.815952  0.366469  1.005362
8 -2.130361  1.902525 -0.761748  2.022376 -1.575673 -0.174841

In [4]:
df.columns = ['a','b','c','d','e','f']
df

          a         b         c         d         e         f
0 -1.200017 -0.143673 -1.581553 -1.302320  1.620774  0.507504
1  0.021663 -0.095572  0.382365 -0.830639 -0.865432 -1.032340
2 -0.185721 -1.521455  0.640193  0.266223 -0.207297 -1.326699
3  1.406219  1.102431  0.796584  0.449783 -1.676008  1.172102
4  1.003298 -1.185395 -1.896151  1.218548  2.060183 -0.114918
5 -1.936451 -0.815682 -0.471055 -0.386179 -0.019781 -0.061896
6  0.122627  0.085518  0.575877 -0.546578  1.924884 -1.135114
7  0.861148  0.892745  1.648597 -0.815952  0.366469  1.005362
8 -2.130361  1.902525 -0.761748  2.022376 -1.575673 -0.174841

In [5]:
dates = pd.date_range('2017-1-1', periods=9, freq='5D')               #时间日期的生成；
dates

DatetimeIndex(['2017-01-01', '2017-01-06', '2017-01-11', '2017-01-16',
               '2017-01-21', '2017-01-26', '2017-01-31', '2017-02-05',
               '2017-02-10'],
              dtype='datetime64[ns]', freq='5D')

In [6]:
df.index = dates
df

                   a         b         c         d         e         f
2017-01-01 -1.200017 -0.143673 -1.581553 -1.302320  1.620774  0.507504
2017-01-06  0.021663 -0.095572  0.382365 -0.830639 -0.865432 -1.032340
2017-01-11 -0.185721 -1.521455  0.640193  0.266223 -0.207297 -1.326699
2017-01-16  1.406219  1.102431  0.796584  0.449783 -1.676008  1.172102
2017-01-21  1.003298 -1.185395 -1.896151  1.218548  2.060183 -0.114918
2017-01-26 -1.936451 -0.815682 -0.471055 -0.386179 -0.019781 -0.061896
2017-01-31  0.122627  0.085518  0.575877 -0.546578  1.924884 -1.135114
2017-02-05  0.861148  0.892745  1.648597 -0.815952  0.366469  1.005362
2017-02-10 -2.130361  1.902525 -0.761748  2.022376 -1.575673 -0.174841

In [175]:
def square_fun(x):
    return x ** 2

In [176]:
df.apply(square_fun)                          #apply方法在很多地方都非常有用，重点掌握；

                   a         b         c         d         e         f
2017-01-01  0.575119  0.007762  0.323813  1.702882  0.032970  0.075999
2017-01-06  1.556192  0.013629  0.165074  1.074784  0.840106  0.190658
2017-01-11  0.010669  0.846362  0.050092  1.292527  0.112853  0.070408
2017-01-16  0.060376  0.510919  0.004851  2.098288  0.327535  3.910949
2017-01-21  0.171904  0.078349  0.648429  0.000971  0.017998  2.986666
2017-01-26  2.329186  1.273189  1.217023  1.989982  0.246846  0.412842
2017-01-31  2.473178  0.010139  0.252300  0.343726  2.174369  0.340715
2017-02-05  0.650409  0.325920  0.978908  0.012502  0.001855  0.263107
2017-02-10  1.556213  2.656653  1.801875  0.001355  0.284346  0.066970

In [177]:
df.apply(lambda x: x ** 0.5)        #可以随意定义函数作用在apply函数里，功能非常强大；

                   a         b         c         d         e         f
2017-01-01       NaN       NaN       NaN       NaN       NaN  0.525052
2017-01-06  1.116904       NaN  0.637411       NaN  0.957378  0.660791
2017-01-11  0.321389  0.959156       NaN       NaN  0.579600  0.515116
2017-01-16  0.495698  0.845450       NaN  1.203556  0.756509       NaN
2017-01-21  0.643904       NaN  0.897358  0.176521       NaN       NaN
2017-01-26       NaN  1.062241  1.050327       NaN       NaN       NaN
2017-01-31       NaN       NaN       NaN  0.765690  1.214320  0.764008
2017-02-05       NaN  0.755576       NaN  0.334385       NaN  0.716198
2017-02-10       NaN       NaN       NaN  0.191848  0.730234       NaN

In [7]:
df

                   a         b         c         d         e         f
2017-01-01 -1.200017 -0.143673 -1.581553 -1.302320  1.620774  0.507504
2017-01-06  0.021663 -0.095572  0.382365 -0.830639 -0.865432 -1.032340
2017-01-11 -0.185721 -1.521455  0.640193  0.266223 -0.207297 -1.326699
2017-01-16  1.406219  1.102431  0.796584  0.449783 -1.676008  1.172102
2017-01-21  1.003298 -1.185395 -1.896151  1.218548  2.060183 -0.114918
2017-01-26 -1.936451 -0.815682 -0.471055 -0.386179 -0.019781 -0.061896
2017-01-31  0.122627  0.085518  0.575877 -0.546578  1.924884 -1.135114
2017-02-05  0.861148  0.892745  1.648597 -0.815952  0.366469  1.005362
2017-02-10 -2.130361  1.902525 -0.761748  2.022376 -1.575673 -0.174841

In [181]:
def find_min(x):
    return x.min()

df.apply(find_min, axis=1)                  #默认axis =  0；

2017-01-01   -1.304945
2017-01-06   -1.036718
2017-01-11   -1.136894
2017-01-16   -1.977612
2017-01-21   -1.728197
2017-01-26   -1.526167
2017-01-31   -1.572634
2017-02-05   -0.989398
2017-02-10   -1.629924
Freq: 5D, dtype: float64

In [182]:
# 指定轴方向
df.apply(lambda x : x.min(), axis=1)

2017-01-01   -1.304945
2017-01-06   -1.036718
2017-01-11   -1.136894
2017-01-16   -1.977612
2017-01-21   -1.728197
2017-01-26   -1.526167
2017-01-31   -1.572634
2017-02-05   -0.989398
2017-02-10   -1.629924
Freq: 5D, dtype: float64

**4.7 DataFrame排序**

In [183]:
df

                   a         b         c         d         e         f
2017-01-01 -0.758366 -0.088099 -0.569046 -1.304945 -0.181577  0.275679
2017-01-06  1.247474 -0.116744  0.406293 -1.036718  0.916573  0.436645
2017-01-11  0.103291  0.919980 -0.223814 -1.136894  0.335937  0.265344
2017-01-16  0.245716  0.714786 -0.069647  1.448547  0.572306 -1.977612
2017-01-21  0.414613 -0.279909  0.805251  0.031160 -0.134155 -1.728197
2017-01-26 -1.526167  1.128357  1.103188 -1.410667 -0.496836 -0.642528
2017-01-31 -1.572634 -0.100693 -0.502295  0.586281  1.474574  0.583708
2017-02-05 -0.806479  0.570894 -0.989398  0.111813 -0.043070  0.512939
2017-02-10 -1.247483 -1.629924 -1.342339  0.036806  0.533241 -0.258785

In [184]:
df.sort_index(ascending=False)              #按index进行排序，ascending升序排序是false，那就是降序排序

                   a         b         c         d         e         f
2017-02-10 -1.247483 -1.629924 -1.342339  0.036806  0.533241 -0.258785
2017-02-05 -0.806479  0.570894 -0.989398  0.111813 -0.043070  0.512939
2017-01-31 -1.572634 -0.100693 -0.502295  0.586281  1.474574  0.583708
2017-01-26 -1.526167  1.128357  1.103188 -1.410667 -0.496836 -0.642528
2017-01-21  0.414613 -0.279909  0.805251  0.031160 -0.134155 -1.728197
2017-01-16  0.245716  0.714786 -0.069647  1.448547  0.572306 -1.977612
2017-01-11  0.103291  0.919980 -0.223814 -1.136894  0.335937  0.265344
2017-01-06  1.247474 -0.116744  0.406293 -1.036718  0.916573  0.436645
2017-01-01 -0.758366 -0.088099 -0.569046 -1.304945 -0.181577  0.275679

In [185]:
df.sort_index(axis=1,ascending=False)

                   f         e         d         c         b         a
2017-01-01  0.275679 -0.181577 -1.304945 -0.569046 -0.088099 -0.758366
2017-01-06  0.436645  0.916573 -1.036718  0.406293 -0.116744  1.247474
2017-01-11  0.265344  0.335937 -1.136894 -0.223814  0.919980  0.103291
2017-01-16 -1.977612  0.572306  1.448547 -0.069647  0.714786  0.245716
2017-01-21 -1.728197 -0.134155  0.031160  0.805251 -0.279909  0.414613
2017-01-26 -0.642528 -0.496836 -1.410667  1.103188  1.128357 -1.526167
2017-01-31  0.583708  1.474574  0.586281 -0.502295 -0.100693 -1.572634
2017-02-05  0.512939 -0.043070  0.111813 -0.989398  0.570894 -0.806479
2017-02-10 -0.258785  0.533241  0.036806 -1.342339 -1.629924 -1.247483

In [188]:
df.sort_values(by= 'b', ascending= False)                     #按value进行排序, PE按升序进行排序；

                   a         b         c         d         e         f
2017-01-26 -1.526167  1.128357  1.103188 -1.410667 -0.496836 -0.642528
2017-01-11  0.103291  0.919980 -0.223814 -1.136894  0.335937  0.265344
2017-01-16  0.245716  0.714786 -0.069647  1.448547  0.572306 -1.977612
2017-02-05 -0.806479  0.570894 -0.989398  0.111813 -0.043070  0.512939
2017-01-01 -0.758366 -0.088099 -0.569046 -1.304945 -0.181577  0.275679
2017-01-31 -1.572634 -0.100693 -0.502295  0.586281  1.474574  0.583708
2017-01-06  1.247474 -0.116744  0.406293 -1.036718  0.916573  0.436645
2017-01-21  0.414613 -0.279909  0.805251  0.031160 -0.134155 -1.728197
2017-02-10 -1.247483 -1.629924 -1.342339  0.036806  0.533241 -0.258785

#### 4.8 DataFrame通用函数应用

In [191]:
df.sum(axis = 1)   #axis =1 转换成为按行统计；

2017-01-01   -2.626354
2017-01-06    1.853522
2017-01-11    0.263845
2017-01-16    0.934096
2017-01-21   -0.891237
2017-01-26   -1.844654
2017-01-31    0.468941
2017-02-05   -0.643301
2017-02-10   -3.908484
Freq: 5D, dtype: float64

In [192]:
df.mean()

a   -0.433337
b    0.124294
c   -0.153534
d   -0.297180
e    0.330777
f   -0.281423
dtype: float64

In [193]:
df.cumsum()    #按列累计求和，在计算策略的收益率曲线时非常有用；

                   a         b         c         d         e         f
2017-01-01 -0.758366 -0.088099 -0.569046 -1.304945 -0.181577  0.275679
2017-01-06  0.489108 -0.204843 -0.162753 -2.341663  0.734996  0.712324
2017-01-11  0.592399  0.715136 -0.386567 -3.478556  1.070932  0.977668
2017-01-16  0.838115  1.429922 -0.456214 -2.030010  1.643239 -0.999944
2017-01-21  1.252728  1.150013  0.349037 -1.998850  1.509084 -2.728141
2017-01-26 -0.273439  2.278370  1.452225 -3.409517  1.012248 -3.370669
2017-01-31 -1.846073  2.177676  0.949929 -2.823236  2.486822 -2.786961
2017-02-05 -2.652552  2.748571 -0.039468 -2.711423  2.443752 -2.274022
2017-02-10 -3.900035  1.118647 -1.381808 -2.674617  2.976993 -2.532807

In [194]:
df.describe()

              a         b         c         d         e         f
count  9.000000  9.000000  9.000000  9.000000  9.000000  9.000000
mean  -0.433337  0.124294 -0.153534 -0.297180  0.330777 -0.281423
std    0.980639  0.835455  0.808564  0.982482  0.617875  0.975034
min   -1.572634 -1.629924 -1.342339 -1.410667 -0.496836 -1.977612
25%   -1.247483 -0.116744 -0.569046 -1.136894 -0.134155 -0.642528
50%   -0.758366 -0.088099 -0.223814  0.031160  0.335937  0.265344
75%    0.245716  0.714786  0.406293  0.111813  0.572306  0.436645
max    1.247474  1.128357  1.103188  1.448547  1.474574  0.583708

**4.9 Dataframe处理缺失值**

In [8]:
df

                   a         b         c         d         e         f
2017-01-01 -1.200017 -0.143673 -1.581553 -1.302320  1.620774  0.507504
2017-01-06  0.021663 -0.095572  0.382365 -0.830639 -0.865432 -1.032340
2017-01-11 -0.185721 -1.521455  0.640193  0.266223 -0.207297 -1.326699
2017-01-16  1.406219  1.102431  0.796584  0.449783 -1.676008  1.172102
2017-01-21  1.003298 -1.185395 -1.896151  1.218548  2.060183 -0.114918
2017-01-26 -1.936451 -0.815682 -0.471055 -0.386179 -0.019781 -0.061896
2017-01-31  0.122627  0.085518  0.575877 -0.546578  1.924884 -1.135114
2017-02-05  0.861148  0.892745  1.648597 -0.815952  0.366469  1.005362
2017-02-10 -2.130361  1.902525 -0.761748  2.022376 -1.575673 -0.174841

In [9]:
np.sqrt(df)                    #pandas的非常强大的特点之一，容错性；而且绝大部分的Numpy的通用函数都可以适用；

                   a         b         c         d         e         f
2017-01-01       NaN       NaN       NaN       NaN  1.273096  0.712393
2017-01-06  0.147183       NaN  0.618357       NaN       NaN       NaN
2017-01-11       NaN       NaN  0.800120  0.515968       NaN       NaN
2017-01-16  1.185841  1.049967  0.892516  0.670659       NaN  1.082636
2017-01-21  1.001647       NaN       NaN  1.103878  1.435334       NaN
2017-01-26       NaN       NaN       NaN       NaN       NaN       NaN
2017-01-31  0.350181  0.292435  0.758866       NaN  1.387402       NaN
2017-02-05  0.927980  0.944852  1.283977       NaN  0.605367  1.002678
2017-02-10       NaN  1.379320       NaN  1.422103       NaN       NaN

In [10]:
np.sqrt(df).sum()              #缺失数据对Pandas操作没有影响

a    3.612833
b    3.666574
c    4.353836
d    3.712608
e    4.701199
f    2.797707
dtype: float64

In [11]:
df_nan = pd.DataFrame([np.random.randn(4), [1.5, np.nan, np.nan, 5],
                       [4.5, np.nan, np.nan, np.nan], [1.5, np.nan, 2.5, np.nan]])
df_nan.head()

          0         1         2         3
0  0.323947  0.856491  0.641102  0.844054
1  1.500000       NaN       NaN  5.000000
2  4.500000       NaN       NaN       NaN
3  1.500000       NaN  2.500000       NaN

In [12]:
# 判断是否为空值
df_nan.isnull()                 #isnull()判断是否为空值

       0      1      2      3
0  False  False  False  False
1  False   True   True  False
2  False   True   True   True
3  False   True  False   True

In [13]:
# 删除空值
df_nan.dropna()         #dropna()

          0         1         2         3
0  0.323947  0.856491  0.641102  0.844054

In [14]:
df_nan.dropna(axis=1)

          0
0  0.323947
1  1.500000
2  4.500000
3  1.500000

In [18]:
df_nan.fillna(0)                                #用0填充；mean，ffill，bfill；

          0         1         2         3
0  0.323947  0.856491  0.641102  0.844054
1  1.500000  0.000000  0.000000  5.000000
2  4.500000  0.000000  0.000000  0.000000
3  1.500000  0.000000  2.500000  0.000000

## 5. 本节重要课程复习

In [19]:
df

                   a         b         c         d         e         f
2017-01-01 -1.200017 -0.143673 -1.581553 -1.302320  1.620774  0.507504
2017-01-06  0.021663 -0.095572  0.382365 -0.830639 -0.865432 -1.032340
2017-01-11 -0.185721 -1.521455  0.640193  0.266223 -0.207297 -1.326699
2017-01-16  1.406219  1.102431  0.796584  0.449783 -1.676008  1.172102
2017-01-21  1.003298 -1.185395 -1.896151  1.218548  2.060183 -0.114918
2017-01-26 -1.936451 -0.815682 -0.471055 -0.386179 -0.019781 -0.061896
2017-01-31  0.122627  0.085518  0.575877 -0.546578  1.924884 -1.135114
2017-02-05  0.861148  0.892745  1.648597 -0.815952  0.366469  1.005362
2017-02-10 -2.130361  1.902525 -0.761748  2.022376 -1.575673 -0.174841

#### 按列选择

In [20]:
df['b']

2017-01-01   -0.143673
2017-01-06   -0.095572
2017-01-11   -1.521455
2017-01-16    1.102431
2017-01-21   -1.185395
2017-01-26   -0.815682
2017-01-31    0.085518
2017-02-05    0.892745
2017-02-10    1.902525
Freq: 5D, Name: b, dtype: float64

In [21]:
df[['c', 'a']]

                   c         a
2017-01-01 -1.581553 -1.200017
2017-01-06  0.382365  0.021663
2017-01-11  0.640193 -0.185721
2017-01-16  0.796584  1.406219
2017-01-21 -1.896151  1.003298
2017-01-26 -0.471055 -1.936451
2017-01-31  0.575877  0.122627
2017-02-05  1.648597  0.861148
2017-02-10 -0.761748 -2.130361

In [23]:
df.c

2017-01-01   -1.581553
2017-01-06    0.382365
2017-01-11    0.640193
2017-01-16    0.796584
2017-01-21   -1.896151
2017-01-26   -0.471055
2017-01-31    0.575877
2017-02-05    1.648597
2017-02-10   -0.761748
Freq: 5D, Name: c, dtype: float64

In [24]:
df.columns

Index(['a', 'b', 'c', 'd', 'e', 'f'], dtype='object')

In [25]:
df[df.columns[1]]              #也可以根据colums的index来选择，index号也是从0开始编号；

2017-01-01   -0.143673
2017-01-06   -0.095572
2017-01-11   -1.521455
2017-01-16    1.102431
2017-01-21   -1.185395
2017-01-26   -0.815682
2017-01-31    0.085518
2017-02-05    0.892745
2017-02-10    1.902525
Freq: 5D, Name: b, dtype: float64

In [26]:
df.ix[:, 1]

2017-01-01   -0.143673
2017-01-06   -0.095572
2017-01-11   -1.521455
2017-01-16    1.102431
2017-01-21   -1.185395
2017-01-26   -0.815682
2017-01-31    0.085518
2017-02-05    0.892745
2017-02-10    1.902525
Freq: 5D, Name: b, dtype: float64

In [27]:
df.ix[:, 'b']

2017-01-01   -0.143673
2017-01-06   -0.095572
2017-01-11   -1.521455
2017-01-16    1.102431
2017-01-21   -1.185395
2017-01-26   -0.815682
2017-01-31    0.085518
2017-02-05    0.892745
2017-02-10    1.902525
Freq: 5D, Name: b, dtype: float64

In [28]:
df.loc[:, 'b']                   #  loc函数可以根据label来进行选择；

2017-01-01   -0.143673
2017-01-06   -0.095572
2017-01-11   -1.521455
2017-01-16    1.102431
2017-01-21   -1.185395
2017-01-26   -0.815682
2017-01-31    0.085518
2017-02-05    0.892745
2017-02-10    1.902525
Freq: 5D, Name: b, dtype: float64

In [30]:
df.loc[:,1]                    #故意报错，loc不能通过position进行选择；

In [33]:
df.iloc[:, 1]                   #  iloc函数只能根据index来进行选择；

2017-01-01   -0.143673
2017-01-06   -0.095572
2017-01-11   -1.521455
2017-01-16    1.102431
2017-01-21   -1.185395
2017-01-26   -0.815682
2017-01-31    0.085518
2017-02-05    0.892745
2017-02-10    1.902525
Freq: 5D, Name: b, dtype: float64

#### 按行选择

In [34]:
df.ix[0]                 #   选择第一行；只有一个参数的话，默认是按行进行选择；

a   -1.200017
b   -0.143673
c   -1.581553
d   -1.302320
e    1.620774
f    0.507504
Name: 2017-01-01 00:00:00, dtype: float64

In [35]:
df.ix['2017-1-31']

a    0.122627
b    0.085518
c    0.575877
d   -0.546578
e    1.924884
f   -1.135114
Name: 2017-01-31 00:00:00, dtype: float64

In [36]:
df.iloc[0]                 # 只能根据position索引选择；

a   -1.200017
b   -0.143673
c   -1.581553
d   -1.302320
e    1.620774
f    0.507504
Name: 2017-01-01 00:00:00, dtype: float64

In [ ]:
df.iloc['2017-1-31']        #iloc不能根据label来进行选择；故意报错；

In [37]:
df.index[0]

Timestamp('2017-01-01 00:00:00', freq='5D')

In [38]:
df.loc['2017-01-31']

a    0.122627
b    0.085518
c    0.575877
d   -0.546578
e    1.924884
f   -1.135114
Name: 2017-01-31 00:00:00, dtype: float64

In [39]:
df.iloc[:2]                   #从开始到第二行；

                   a         b         c         d         e         f
2017-01-01 -1.200017 -0.143673 -1.581553 -1.302320  1.620774  0.507504
2017-01-06  0.021663 -0.095572  0.382365 -0.830639 -0.865432 -1.032340

In [40]:
df[:2]

                   a         b         c         d         e         f
2017-01-01 -1.200017 -0.143673 -1.581553 -1.302320  1.620774  0.507504
2017-01-06  0.021663 -0.095572  0.382365 -0.830639 -0.865432 -1.032340